app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "123123"], ["updated_at", "2016-02-01 06:13:05.552201"], ["id", 7]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))